Тестирование веб-сайта Skillfactory. Используемое окружение браузер GoogleChrome версия 129.0.6668.100 (Официальная сборка), (64 бит).
Написать 20-30 автоматизированных тестов с использованием Java, JUnit и Selenium. Фрейморки JUnit и Selenium нужно установить.
Версия JUnit 4.13.2 , Selenium Java 4.25.0 , webdrivermanager 3.8.1 .
Также должна быть установленна IntelliJ IDEA Community Edition 2024.1.4 и фрейморк Maven http://maven.apache.org/POM/4.0.0 версия 4.0.0
Открываем класс SFProject.
Написано 22 автоматизированных тестов. Из них 19 автоматизированных тестов с позитивными сценариями, 3 автоматизированных тестов с негативным сценарием. Один тест с ннегативным сценарием падает.
Запускать тесты с помощь команды Run 'SFProject' зелённый треугольник в верху. Либо с помощью этой комбинации клавиш Shift + F10.